Repository: mrasadbekmatvaliyev/paylog
Catalog: users/locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Phone is required.
ru: Телефон обязателен.
uz: Telefon raqami talab qilinadi.

source: SMS is required.
ru: Требуется SMS-код.
uz: SMS kodi talab qilinadi.

source: SMS sent successfully.
ru: SMS-код успешно отправлен.
uz: SMS kodi muvaffaqiyatli yuborildi.

source: Invalid or expired SMS.
ru: Неверный или просроченный SMS-код.
uz: SMS kodi noto'g'ri yoki muddati o'tgan.

source: Too many attempts. Please request a new SMS.
ru: Слишком много попыток. Пожалуйста, запросите новый SMS-код.
uz: Juda ko'p urinishlar. Yangi SMS kodini so'rang.

source: SMS verified successfully.
ru: SMS-код успешно подтвержден.
uz: SMS kodi muvaffaqiyatli tasdiqlandi.

source: User is inactive.
ru: Пользователь неактивен.
uz: Foydalanuvchi faol emas.

source: Profile fetched successfully.
ru: Профиль успешно получен.
uz: Profil muvaffaqiyatli olindi.

source: Invalid profile data.
ru: Некорректные данные профиля.
uz: Profil ma'lumotlari noto'g'ri.

source: Profile updated successfully.
ru: Профиль успешно обновлен.
uz: Profil muvaffaqiyatli yangilandi.

source: Invalid request data.
ru: Неверные данные запроса.
uz: So'rov ma'lumotlari noto'g'ri.

source: Telegram bot not configured.
ru: Телеграм-бот не настроен.
uz: Telegram boti sozlanmagan.

source: SMS already sent. Please wait before requesting again.
ru: SMS-код уже отправлен. Пожалуйста, подождите перед повторным запросом.
uz: SMS kodi allaqachon yuborilgan. Qayta so'rashdan oldin biroz kuting.

source: Failed to send SMS.
ru: Не удалось отправить SMS-код.
uz: SMS yuborib bo'lmadi.

source: SMS resent successfully.
ru: SMS-код успешно отправлен повторно.
uz: SMS kodi qayta yuborildi.

source: Phone already in use.
ru: Телефон уже используется.
uz: Telefon raqami allaqachon ishlatilmoqda.

source: User not found.
ru: Пользователь не найден.
uz: Foydalanuvchi topilmadi.
